app/controllers/todocontroller_controller.rb

  def new
    @task = Task.find_or_create_by(task_name: params[:name], description: params[:desc], status: 0)
    @task.save!
    params[:tags].each do |t|
      @task.tags.find_or_create_by(tag: t['text'])
    end
    @tasks = Task.all
---
INSERT INTO `tags_tasks` (`task_id`, `tag_id`) VALUES (4, 32)
INSERT INTO `tasks` (`task_name`, `description`, `status`, `created_at`, `updated_at`) VALUES ('hj', 'fdgh', 1, '2016-03-01 08:22:47', '2016-03-01 08:22:47')
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`task_name` = 'task124' AND `tasks`.`description` = 'it1' AND `tasks`.`status` = 0 LIMIT 1
SELECT  `tags`.* FROM `tags` WHERE `tags`.`tag` = 'translation missing: en.no key' LIMIT 1
INSERT INTO `tags` (`tag`, `created_at`, `updated_at`) VALUES ('playing', '2016-03-01 07:19:48', '2016-03-01 07:19:48')
SELECT  `tags`.* FROM `tags` INNER JOIN `tags_tasks` ON `tags`.`id` = `tags_tasks`.`tag_id` WHERE `tags_tasks`.`task_id` = 18 AND `tag`.`text` = 'sdgsdg' LIMIT 1
SELECT `tasks`.* FROM `tasks`

  def search
    puts params
    @tag = Tag.find_by(tag: params[:tag])
---
SELECT  `tags`.* FROM `tags` WHERE `tags`.`tag` = 'sdfh' LIMIT 1

  def toggle_status
    @task = Task.find_by(id: params[:id])
    if @task.status === false
      @task.update(status: true)
    else
      @task.update(status: false)
                    end
    @task.save
    @tasks = Task.all
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` IS NULL LIMIT 1
UPDATE `tasks` SET `status` = 1, `updated_at` = '2016-03-03 05:10:07' WHERE `tasks`.`id` = 5
SELECT `tasks`.* FROM `tasks`

  def show_completed
    @tasks_completed = Task.where(status: true)
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`status` = 1

  def show_incomplete
    @tasks_incomplete = Task.where(status: false)
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`status` = 0

  def show_all
    @tasks = Task.all
---
SELECT `tasks`.* FROM `tasks`

  def delete
    @task = Task.find_by(id: params[:id])
    @task.destroy
    @tasks = Task.all
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` IS NULL LIMIT 1
DELETE FROM `tags_tasks` WHERE `tags_tasks`.`task_id` = 4
DELETE FROM `tasks` WHERE `tasks`.`id` = 4
SELECT `tasks`.* FROM `tasks`

  def delete_completed
    puts 'testing line'
    puts params
    @tasks = Task.where(status: true)
    @tasks.destroy_all
    @tasks=Task.all
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`status` = 1
DELETE FROM `tags_tasks` WHERE `tags_tasks`.`task_id` = 15
DELETE FROM `tasks` WHERE `tasks`.`id` = 15
SELECT `tasks`.* FROM `tasks`

  def update_task
    data = JSON.parse(params[:data])
    puts "sdfsdfsdfsdf"
    puts "sdfsdfsdfsdf"
    puts data["id"]
    puts "sdfsdfsdfsdf"
    puts "sdfsdfsdfsdf"
    @task = Task.find(data["id"])
    @task.task_name = data["name"]
    @task.description = data["desc"]
    @task.save!
    @idList = []
    data["tags"].each do |t|
      @exist_tag = Tag.find_by(tag: t["text"])
      if @exist_tag.nil?
        @tag = Tag.create(tag: t["text"])
        @idList.push(@tag.id)
      else
        @idList.push (@exist_tag.id)
    end
    end
    @task.tag_ids = @idList
    @tasks = Task.all
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` IS NULL LIMIT 1
UPDATE `tasks` SET `description` = 'itklkl', `updated_at` = '2016-03-04 10:23:04' WHERE `tasks`.`id` = 15
SELECT  `tags`.* FROM `tags` WHERE `tags`.`tag` = 'asd' LIMIT 1
INSERT INTO `tags` (`tag`, `created_at`, `updated_at`) VALUES ('asdasd', '2016-03-04 10:41:24', '2016-03-04 10:41:24')
SELECT `tasks`.* FROM `tasks`